# Подвиг 1
# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[:3])

# Подвиг 2
# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[-4:])

# Подвиг 3
# c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
# print(c[::2])

# Подвиг 4
# c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
# print(c[1::2])

# Подвиг 5
# m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# a = list(m[2:7:])
# print(a[::-1])

# Подвиг 6
# m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# print(m[::-2])

# print(ord('5'))
# print(ord('4'))
