# Подвиг 1
# Вводится строка. Необходимо найти все индексы фрагмента "ра" во введенной строке.
# Вывести в строку через пробелы найденные индексы. Если этот фрагмент ни разу не
# будет найден, то вывести значение -1.
# string = input()
# indices = [str(i) for i in range(len(string)) if string[i:i+2] == "ра"]
# result = " ".join(indices) if indices else "-1"
# print(result)
