# Подвиг 5
# num = float(input())
# res = int(num) % 3 == 0
# print(res)

# Подвиг 6
#  Вводится стоимость книги X рублей (например, X = 435.78) — положительное
#  вещественное число с точностью до сотых (два знака после запятой). Требуется
#  определить, является ли дробное значение (число после запятой) больше 50. На
#  экран вывести True, если больше и False — в противном случае. Задача делается
#  без использования условного оператора.
# num = float(input())
# res = (num - int(num)) * 100 > 50
# print(res)

# Подвиг 7
# a, b = map(int, input().split())
# res = a % b == 0
# print(res)

# Подвиг 10
# a, b, c = map(int, input().split())
# treug = a + b > c and a + c > b and c + b > a
# print(treug)

# Подвиг 11
# num = float(input())
# diap = 0 <= num <= 2 or 10 <= num <= 20
# print(diap)
